HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxHssl_regdef.h
/** \\brief  Miscellaneous Flags Set Register */
typedef struct _Ifx_HSSL_MFLAGSSET_Bits
{
    unsigned int NACKS:4;                   /**< \brief [3:0] NACK Flags Set (w) */
    unsigned int TTES:4;                    /**< \brief [7:4] Transaction Tag Error Flags Set (w) */
    unsigned int TIMEOUTS:4;                /**< \brief [11:8] Timeout Error Flags Set (w) */
    unsigned int UNEXPECTEDS:4;             /**< \brief [15:12] Unexpected Error Flags Set (w) */
    unsigned int reserved_16:2;             /**< \brief \internal Reserved */
    unsigned int TMBS:1;                    /**< \brief [18:18] Target Memory Block Flag Set (w) */
    unsigned int IMBS:1;                    /**< \brief [19:19] Initiator Memory Block Flag Set (w) */
    unsigned int ISBS:1;                    /**< \brief [20:20] Initiator Stream Block Request Set (w) */
    unsigned int MAVS:1;                    /**< \brief [21:21] MAV Flag Set (w) */
    unsigned int SRIES:1;                   /**< \brief [22:22] SRI/SPB Bus Access Error Flag Set (w) */
    unsigned int PIE1S:1;                   /**< \brief [23:23] PIE1 Error Flag Set (w) */
    unsigned int PIE2S:1;                   /**< \brief [24:24] PIE2 Error Flag Set (w) */
    unsigned int CRCES:1;                   /**< \brief [25:25] CRC Error Flag Set (w) */
    unsigned int reserved_26:2;             /**< \brief \internal Reserved */
    unsigned int TSES:1;                    /**< \brief [28:28] Target Stream Enable Flag Set (w) */
    unsigned int reserved_29:1;             /**< \brief \internal Reserved */
    unsigned int TEOS:1;                    /**< \brief [30:30] Transmit Enable Flag Set (w) */
    unsigned int INIS:1;                    /**< \brief [31:31] Initialize Mode Flag Set (w) */
} Ifx_HSSL_MFLAGSSET_Bits;

/** \\brief  OCDS Control and Status */
typedef struct _Ifx_HSSL_OCS_Bits
{
    unsigned int TGS:2;                     /**< \brief [1:0] Trigger Set for OTGB0/1 (rw) */
    unsigned int TGB:1;                     /**< \brief [2:2] OTGB0/1 Bus Select (rw) */
    unsigned int TG_P:1;                    /**< \brief [3:3] TGS, TGB Write Protection (w) */
    unsigned int reserved_4:20;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_HSSL_OCS_Bits;

/** \\brief  Request Flags Register */
typedef struct _Ifx_HSSL_QFLAGS_Bits
{
    unsigned int I:4;                       /**< \brief [3:0] Request Flags for Initiated Commands (rh) */
    unsigned int T:4;                       /**< \brief [7:4] Request Flags for Commands Arrived at Target (rh) */
    unsigned int R:4;                       /**< \brief [11:8] Request Flags for Response Frames at the Target (rh) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int E0:2;                      /**< \brief [17:16] Expect Flags for Activated Timeout Timer 0 (rh) */
    unsigned int E1:2;                      /**< \brief [19:18] Expect Flags for Activated Timeout Timer 1 (rh) */
    unsigned int E2:2;                      /**< \brief [21:20] Expect Flags for Activated Timeout Timer 2 (rh) */
    unsigned int E3:2;                      /**< \brief [23:22] Expect Flags for Activated Timeout Timer 3 (rh) */
    unsigned int reserved_24:4;             /**< \brief \internal Reserved */
    unsigned int IS:1;                      /**< \brief [28:28] I Flag for Stream Frames (rh) */
    unsigned int RS:1;                      /**< \brief [29:29] R Flag for Stream Frames (rh) */
    unsigned int TS:1;                      /**< \brief [30:30] T Flag for Stream Frames (rh) */
    unsigned int ES:1;                      /**< \brief [31:31] E Flag for Stream Frames (rh) */
} Ifx_HSSL_QFLAGS_Bits;

/** \\brief  Stream FIFOs Status Flags Register */
typedef struct _Ifx_HSSL_SFSFLAGS_Bits
{
    unsigned int RXFL:2;                    /**< \brief [1:0] Stream RxFIFO Filling Level (rh) */
    unsigned int TXFL:2;                    /**< \brief [3:2] Stream TxFIFO Filling Level (rh) */
    unsigned int EXFL:2;                    /**< \brief [5:4] Stream Expect FIFO Filling Level (rh) */
    unsigned int reserved_6:9;              /**< \brief \internal Reserved */
    unsigned int ISF:1;                     /**< \brief [15:15] Initiator Stream Frame Request (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_HSSL_SFSFLAGS_Bits;

/** \\brief  Target Current Address Register */
typedef struct _Ifx_HSSL_T_TCA_Bits
{
    unsigned int A:32;                      /**< \brief [31:0] Address Part of the Payload of a Write Command Frame or a Read Command Frame or ID Frame (rh) */
} Ifx_HSSL_T_TCA_Bits;

/** \\brief  Target Current Data Register */
typedef struct _Ifx_HSSL_T_TCD_Bits
{
    unsigned int D:32;                      /**< \brief [31:0] Data Part of the Payload of a Write Command Frame or Read Data of a Read Command Frame (rh) */
} Ifx_HSSL_T_TCD_Bits;

/** \\brief  Target ID Address Register */
typedef struct _Ifx_HSSL_TIDADD_Bits
{
    unsigned int A:32;                      /**< \brief [31:0] Address Pointer (rw) */
} Ifx_HSSL_TIDADD_Bits;

/** \\brief  Target Stream Current Address Register */
typedef struct _Ifx_HSSL_TS_CA_Bits
{
    unsigned int reserved_0:5;              /**< \brief \internal Reserved */
    unsigned int CURR:27;                   /**< \brief [31:5] Address of the Memory Location for the Current Transfer (rh) */
} Ifx_HSSL_TS_CA_Bits;

/** \\brief  Target Stream Frame Count Register */
typedef struct _Ifx_HSSL_TS_FC_Bits
{
    unsigned int RELCOUNT:16;               /**< \brief [15:0] Reload Count Number (rw) */
    unsigned int CURCOUNT:16;               /**< \brief [31:16] Current Count Number (rh) */
} Ifx_HSSL_TS_FC_Bits;

/** \\brief  Target Stream Start Address Register */
typedef struct _Ifx_HSSL_TSSA_Bits
{
    unsigned int reserved_0:5;              /**< \brief \internal Reserved */
    unsigned int ADDR:27;                   /**< \brief [31:5] Start Address for the Memory Range (rw) */
} Ifx_HSSL_TSSA_Bits;

/** \\brief  Target Status Register */
typedef struct _Ifx_HSSL_TSTAT_Bits
{
    unsigned int LASTCC0:5;                 /**< \brief [4:0] Last Command Code (rh) */
    unsigned int LASTTT0:3;                 /**< \brief [7:5] Last Transaction Tag (rh) */
    unsigned int LASTCC1:5;                 /**< \brief [12:8] Last Command Code (rh) */
    unsigned int LASTTT1:3;                 /**< \brief [15:13] Last Transaction Tag (rh) */
    unsigned int LASTCC2:5;                 /**< \brief [20:16] Last Command Code (rh) */
    unsigned int LASTTT2:3;                 /**< \brief [23:21] Last Transaction Tag (rh) */
    unsigned int LASTCC3:5;                 /**< \brief [28:24] Last Command Code (rh) */
    unsigned int LASTTT3:3;                 /**< \brief [31:29] Last Transaction Tag (rh) */
} Ifx_HSSL_TSTAT_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Hssl_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_ACCEN0_Bits B;
} Ifx_HSSL_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_ACCEN1_Bits B;
} Ifx_HSSL_ACCEN1;

/** \\brief  Access Rules Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_AR_Bits B;
} Ifx_HSSL_AR;

/** \\brief  Access Window End Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_AW_AWEND_Bits B;
} Ifx_HSSL_AW_AWEND;

